KanatERPSukhova.КанатАдаптация/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ВсегоСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/РасходныйОрдерНаТовары/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура КАНАТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//++ Гурьев ЧТЗ_2.3 15.09.23
	КАНАТ_ЗаполнитьКомментарийТоварыПоРаспоряжениям();
	КАНАТ_ЗаполнитьКомментарийОтгружаемыеТовары();
	//-- Гурьев ЧТЗ_2.3 15.09.23
КонецПроцедуры

//++ Гурьев ЧТЗ_2.3 15.09.23
Процедура КАНАТ_ЗаполнитьКомментарийТоварыПоРаспоряжениям()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТТоварыПоРаспоряжениям
		|ИЗ &ТоварыПоРаспоряжениям КАК ТоварыПоРаспоряжениям;
		|
		|///////////////////////////////
		|ВЫБРАТЬ
		|	ВТТоварыПоРаспоряжениям.НомерСтроки КАК НомерСтроки,
		|	ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
		|	ЗаказКлиентаТовары.КАНАТ_Сертификат КАК КАНАТ_Сертификат
		|ИЗ
		|	ВТТоварыПоРаспоряжениям КАК ВТТоварыПоРаспоряжениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО ВТТоварыПоРаспоряжениям.Распоряжение = ЗаказКлиентаТовары.Ссылка
		|ГДЕ
		|	ВТТоварыПоРаспоряжениям.Номенклатура = ЗаказКлиентаТовары.Номенклатура 
		|	И ВТТоварыПоРаспоряжениям.Характеристика = ЗаказКлиентаТовары.Характеристика
		|	И ВТТоварыПоРаспоряжениям.Серия = ЗаказКлиентаТовары.Серия
		|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
		|	И ЗаказКлиентаТовары.КАНАТ_КомментарийКЗаказу <> """"
		|ИТОГИ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТоварыПоРаспоряжениям", ТоварыПоРаспоряжениям.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНомерСтроки.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ВыборкаНомерСтроки.Выбрать();
	
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			ЭтотОбъект.ТоварыПоРаспоряжениям[ВыборкаНомерСтроки.НомерСтроки-1].КАНАТ_КомментарийКЗаказу = ВыборкаДетальныеЗаписи.КАНАТ_КомментарийКЗаказу;
			ЭтотОбъект.ТоварыПоРаспоряжениям[ВыборкаНомерСтроки.НомерСтроки-1].КАНАТ_Сертификат = ВыборкаДетальныеЗаписи.КАНАТ_Сертификат;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//-- Гурьев ЧТЗ_2.3 15.09.23


//++ Гурьев ЧТЗ_2.3 15.09.23
Процедура КАНАТ_ЗаполнитьКомментарийОтгружаемыеТовары() Экспорт
	
	Для Каждого СтрокаОтгружаемыеТовары Из ОтгружаемыеТовары Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура",   СтрокаОтгружаемыеТовары.Номенклатура);
		СтруктураОтбора.Вставить("Характеристика", СтрокаОтгружаемыеТовары.Характеристика);
		СтрокиТоварыПоРаспоряжениям = ТоварыПоРаспоряжениям.НайтиСтроки(СтруктураОтбора);
		Если СтрокиТоварыПоРаспоряжениям.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КАНАТ_КомментарийКЗаказу = "";
		КАНАТ_Сертификат = "";
		
		Для Каждого Строка Из СтрокиТоварыПоРаспоряжениям Цикл 
			
			Если Не ПустаяСтрока(КАНАТ_КомментарийКЗаказу) Тогда
				КАНАТ_КомментарийКЗаказу = КАНАТ_КомментарийКЗаказу + "; ";
			КонецЕсли;
			
			КАНАТ_КомментарийКЗаказу = КАНАТ_КомментарийКЗаказу + Строка.КАНАТ_КомментарийКЗаказу;
			
			Если Не ПустаяСтрока(КАНАТ_Сертификат) Тогда
				КАНАТ_Сертификат = КАНАТ_Сертификат + "; ";
			КонецЕсли;
			
			КАНАТ_Сертификат = КАНАТ_Сертификат + Строка.КАНАТ_Сертификат
			
		КонецЦикла;
		
		СтрокаОтгружаемыеТовары.КАНАТ_КомментарийКЗаказу = КАНАТ_КомментарийКЗаказу;
		СтрокаОтгружаемыеТовары.КАНАТ_Сертификат = КАНАТ_Сертификат;
		
	КонецЦикла
	
КонецПроцедуры
//-- Гурьев ЧТЗ_2.3 15.09.23
